Revit 2027 API
BuiltInFailures.StairRampFailures.RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning Property
 Run is joining landing with riser, so notch configuration does not take effect. Try to set run as begin/end with tread to make a notch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning { get; }
Public Shared ReadOnly Property RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning {
	FailureDefinitionId^ get ();
}
static member RunIsJoiningLandingWithRiserSoNotchDoesNotWorkWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace